/*********************************************************************************************************************
* COPYRIGHT NOTICE
* Copyright (c) 2019,逐飞科技
* All rights reserved.
* 技术讨论QQ群：一群：179029047(已满)  二群：244861897
*
* 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
* 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
*
* @file				main
* @company			成都逐飞科技有限公司
* @author			逐飞科技(QQ3184284598)
* @version			查看doc内version文件 版本说明
* @Software			IAR 8.3 or MDK 5.24
* @Target core		MM32SPIN2XPs
* @Taobao			https://seekfree.taobao.com/
* @date				2020-11-23
********************************************************************************************************************/

#include "headfile.h"

// *************************** 例程说明 ***************************
// 
// 测试需要准备逐飞科技MM32SPIIN27PS核心板一块
// 
// 调试下载需要准备逐飞科技CMSIS-DAP或Jlink调试下载器一个
// 
// 本例程初始化了逐飞科技MM32SPIIN27PS核心板上的A4/D7两个LED对应的引脚
// 并初始化了一个TIM作为PIT周期中断
// 
// 烧录本例程后 可见A4/D7交错亮起 频率为PIT设置频率 串口会输出中断触发信息
// 
// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project  clean  等待下方进度条走完
// 
// *************************** 例程说明 ***************************

// **************************** 宏定义 ****************************
// **************************** 宏定义 ****************************

// **************************** 变量定义 ****************************
bool interrupt_flag = false;														// 中断触发标志 在isr.c中置位
bool io_output = false;																// IO输出状态
// **************************** 变量定义 ****************************

// **************************** 代码区域 ****************************
int main(void)
{
	board_init(true);																// 初始化 debug 输出串口

	tim_interrupt_init(TIM_1, 2, 3);												// 初始化TIM1频率2Hz中断优先级3 

	gpio_init(A4, GPO, GPIO_HIGH, GPO_PUSH_PULL);									// 初始化引脚为推挽输出 默认高电平
	gpio_init(D7, GPO, GPIO_HIGH, GPO_PUSH_PULL);									// 初始化引脚为推挽输出 默认高电平

	while(1)
	{
		if(interrupt_flag)															// 等待中断触发
		{
			interrupt_flag = false;													// 清空触发标志
			io_output = !io_output;													// 翻转IO输出
			gpio_set(A4, !io_output);												// 输出LED-A4
			gpio_set(D7, io_output);												// 输出LED-D7
			printf("\r\nRaise the interrupt.");										// 串口输出信息
		}
	}
}
// **************************** 代码区域 ****************************
